In [1]:
import numpy as np
import pandas as pd

# Series

In [2]:
x = pd.Series([10,20,30,40,50])
x

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [3]:
x.index

RangeIndex(start=0, stop=5, step=1)

In [4]:
x.values

array([10, 20, 30, 40, 50], dtype=int64)

In [5]:
x.dtype

dtype('int64')

### Our own index

In [6]:
data = [450,650,870]
sales = pd.Series(data, index=["Bob", "Sally", "Don"])
sales

Bob      450
Sally    650
Don      870
dtype: int64

In [7]:
sales.index

Index(['Bob', 'Sally', 'Don'], dtype='object')

In [8]:
sales['Bob']

450

In [9]:
sales[0]

450

### Filtering data

In [10]:
sales[sales > 500]

Sally    650
Don      870
dtype: int64

In [11]:
'Don' in sales

True

In [12]:
650 in sales

False

In [13]:
650 in sales.values

True

In [14]:
sales_dict = sales.to_dict()
sales_dict

{'Bob': 450, 'Sally': 650, 'Don': 870}

In [15]:
sales_ser = pd.Series(sales_dict)
sales_ser

Bob      450
Sally    650
Don      870
dtype: int64

### Adding new records

In [16]:
new_sales = pd.Series(sales,index=['Don','Sally','Lucy','Mike','Bob'])
new_sales

Don      870.0
Sally    650.0
Lucy       NaN
Mike       NaN
Bob      450.0
dtype: float64

In [17]:
np.isnan(new_sales)

Don      False
Sally    False
Lucy      True
Mike      True
Bob      False
dtype: bool

In [18]:
pd.isnull(new_sales)

Don      False
Sally    False
Lucy      True
Mike      True
Bob      False
dtype: bool

In [19]:
new_sales.index.name = "Sales Person"
new_sales

Sales Person
Don      870.0
Sally    650.0
Lucy       NaN
Mike       NaN
Bob      450.0
dtype: float64

In [20]:
new_sales.name = "Total Sales"
new_sales

Sales Person
Don      870.0
Sally    650.0
Lucy       NaN
Mike       NaN
Bob      450.0
Name: Total Sales, dtype: float64

# Data Frames

In [21]:
data = [['Don',870],['Sally',678],['Bob',4756]]
df = pd.DataFrame(data, columns=["Name","Sales"])
df

    Name  Sales
0    Don    870
1  Sally    678
2    Bob   4756

In [22]:
sales_dict

{'Bob': 450, 'Sally': 650, 'Don': 870}

In [23]:
df_dict = pd.DataFrame(sales_dict,index=[1])
df_dict

   Bob  Sally  Don
1  450    650  870

In [24]:
dict_list = [{'Name':'Tom','Sales':250},{'Name':'Jane','Sales':300},{'Name':'Steve','Sales':350}
,{'Name':'Lucy','Sales':400}]
dict_list

[{'Name': 'Tom', 'Sales': 250},
 {'Name': 'Jane', 'Sales': 300},
 {'Name': 'Steve', 'Sales': 350},
 {'Name': 'Lucy', 'Sales': 400}]

In [25]:
df_dict_list = pd.DataFrame(dict_list)
df_dict_list

    Name  Sales
0    Tom    250
1   Jane    300
2  Steve    350
3   Lucy    400

In [26]:
east = pd.Series([1000,1200,3400],index=['Q1','Q2','Q3'])
west = pd.Series([1100,1300,2400,3500],index=['Q1','Q2','Q3','Q4'])

In [27]:
east

Q1    1000
Q2    1200
Q3    3400
dtype: int64

In [28]:
west

Q1    1100
Q2    1300
Q3    2400
Q4    3500
dtype: int64

In [29]:
df_region = pd.DataFrame({'East':east, 'West':west})
df_region

      East  West
Q1  1000.0  1100
Q2  1200.0  1300
Q3  3400.0  2400
Q4     NaN  3500

In [30]:
years = ['2015','2016','2017','2018']
df_region['Years'] = years
df_region

      East  West Years
Q1  1000.0  1100  2015
Q2  1200.0  1300  2016
Q3  3400.0  2400  2017
Q4     NaN  3500  2018

In [31]:
df_region = df_region.set_index('Years')
df_region

         East  West
Years
2015   1000.0  1100
2016   1200.0  1300
2017   3400.0  2400
2018      NaN  3500

In [32]:
new_df = df_region.reindex(['2014','2015','2016','2017','2018','2019'])
new_df

         East    West
Years
2014      NaN     NaN
2015   1000.0  1100.0
2016   1200.0  1300.0
2017   3400.0  2400.0
2018      NaN  3500.0
2019      NaN     NaN

In [33]:
new_df = new_df.reindex(columns = ['East','South','West'])
new_df

         East  South    West
Years
2014      NaN    NaN     NaN
2015   1000.0    NaN  1100.0
2016   1200.0    NaN  1300.0
2017   3400.0    NaN  2400.0
2018      NaN    NaN  3500.0
2019      NaN    NaN     NaN

### Filling nan with zero

In [34]:
new_df.fillna(0)

         East  South    West
Years
2014      0.0    0.0     0.0
2015   1000.0    0.0  1100.0
2016   1200.0    0.0  1300.0
2017   3400.0    0.0  2400.0
2018      0.0    0.0  3500.0
2019      0.0    0.0     0.0

In [35]:
new_df.fillna(method='bfill')  #bfill ffill

         East  South    West
Years
2014   1000.0    NaN  1100.0
2015   1000.0    NaN  1100.0
2016   1200.0    NaN  1300.0
2017   3400.0    NaN  2400.0
2018      NaN    NaN  3500.0
2019      NaN    NaN     NaN

In [36]:
new_df.interpolate()

         East  South    West
Years
2014      NaN    NaN     NaN
2015   1000.0    NaN  1100.0
2016   1200.0    NaN  1300.0
2017   3400.0    NaN  2400.0
2018   3400.0    NaN  3500.0
2019   3400.0    NaN  3500.0

### Droping nan

In [37]:
new_df.dropna(thresh=1)              # axis: 0:rows,1:columns
                                    # how: all, any, 
                                    #thresh: 1 if is has more keep

         East  South    West
Years
2015   1000.0    NaN  1100.0
2016   1200.0    NaN  1300.0
2017   3400.0    NaN  2400.0
2018      NaN    NaN  3500.0

In [38]:
new_df.drop('2019')

         East  South    West
Years
2014      NaN    NaN     NaN
2015   1000.0    NaN  1100.0
2016   1200.0    NaN  1300.0
2017   3400.0    NaN  2400.0
2018      NaN    NaN  3500.0

In [39]:
new_df['East']

Years
2014       NaN
2015    1000.0
2016    1200.0
2017    3400.0
2018       NaN
2019       NaN
Name: East, dtype: float64

In [40]:
new_df.iloc[1]  # Row index

East     1000.0
South       NaN
West     1100.0
Name: 2015, dtype: float64

In [41]:
new_df.loc[['2016','2017']] # Row index name

         East  South    West
Years
2016   1200.0    NaN  1300.0
2017   3400.0    NaN  2400.0

In [42]:
new_df

         East  South    West
Years
2014      NaN    NaN     NaN
2015   1000.0    NaN  1100.0
2016   1200.0    NaN  1300.0
2017   3400.0    NaN  2400.0
2018      NaN    NaN  3500.0
2019      NaN    NaN     NaN

In [43]:
new_df.sort_index(ascending=False)

         East  South    West
Years
2019      NaN    NaN     NaN
2018      NaN    NaN  3500.0
2017   3400.0    NaN  2400.0
2016   1200.0    NaN  1300.0
2015   1000.0    NaN  1100.0
2014      NaN    NaN     NaN

In [44]:
new_df.sort_values(by=['East','West'], ascending=False)

         East  South    West
Years
2017   3400.0    NaN  2400.0
2016   1200.0    NaN  1300.0
2015   1000.0    NaN  1100.0
2018      NaN    NaN  3500.0
2014      NaN    NaN     NaN
2019      NaN    NaN     NaN

## Activity
- read csv
- iris .csv
- put into a data frame
- group by method 
- .head method to show first 5 rows 
- .describe on iris and after group by 
-

In [45]:
data = pd.read_csv('iris.csv')
data

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [46]:
data.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [47]:
data.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.054000      3.758667     1.198667
std        0.828066     0.433594      1.764420     0.763161
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [48]:
new_data = data.groupby('species')[['sepal_length','sepal_width','petal_length']].sum()
new_data

            sepal_length  sepal_width  petal_length
species
setosa             250.3        170.9          73.2
versicolor         296.8        138.5         213.0
virginica          329.4        148.7         277.6

In [49]:
data.groupby('species').describe().pivot_table

<bound method DataFrame.pivot_table of            sepal_length                                              \
                  count   mean       std  min    25%  50%  75%  max
species
setosa             50.0  5.006  0.352490  4.3  4.800  5.0  5.2  5.8
versicolor         50.0  5.936  0.516171  4.9  5.600  5.9  6.3  7.0
virginica          50.0  6.588  0.635880  4.9  6.225  6.5  6.9  7.9

           sepal_width         ... petal_length      petal_width         \
                 count   mean  ...          75%  max       count   mean
species                        ...
setosa            50.0  3.418  ...        1.575  1.9        50.0  0.244
versicolor        50.0  2.770  ...        4.600  5.1        50.0  1.326
virginica         50.0  2.974  ...        5.875  6.9        50.0  2.026


                 std  min  25%  50%  75%  max
species
setosa      0.107210  0.1  0.2  0.2  0.3  0.6
versicolor  0.197753  1.0  1.2  1.3  1.5  1.8
virginica   0.274650  1.4  1.8  2.0  2.3  2.5

[3 rows x 32 columns]>

In [50]:
data_mean = data.groupby('species').mean()

In [51]:
data_sepal = data[['species','sepal_length','sepal_width']]

In [52]:
data_petal = data[['species','petal_length','petal_width']]

In [53]:
data_setosa = data.loc[data['species'] == 'setosa']
data_setosa.reset_index(drop=True)
data_versicolor = data.loc[data['species'] == 'versicolor']
data_versicolor.reset_index(drop=True)
data_virginica = data.loc[data['species'] == 'virginica']
data_virginica.reset_index(drop=True)
data=data

In [54]:
data_ranked = data
data_ranked["rank"] = data_ranked['petal_length'].rank(method='dense')
#data_ranked.sort_values('petal_length')

In [73]:
#joining the two sepal petal data frames:
merged_data_one = data_sepal
merged_data_one = merged_data_one.merge(data_petal,left_index=True,right_index=True)
merged_data_one['species'] = merged_data_one['species_x']
merged_data_one = merged_data_one[['sepal_length','sepal_width','petal_length','petal_width','species']]

In [72]:
#joining the 3 species together:
merged_data_two = pd.concat([data_setosa,data_versicolor,data_virginica])